# Taps
tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/cask"
tap 'homebrew/cask-drivers'
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask_args appdir: "/Applications"

# Binaries
brew 'ack'
brew 'ag'
brew 'aspell'
brew 'autojump'
brew 'bash' # Latest Bash version, make sure to add it to list of shells
brew 'bash-completion'
brew 'blueutil'
brew 'brew-cask-completion'
brew 'bat' # "cat" on steroids
brew 'cmake'
brew 'colordiff'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'dark-mode'
brew 'diff-so-fancy'
brew 'direnv'
brew 'django-completion'
brew 'docker-completion'
brew 'dockutil'
brew 'duti'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'findutils' # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'fonttools'
brew 'fzf'
brew 'gawk'
brew 'gettext'
brew 'git'
brew 'git-cinnabar' # mercurial
brew 'git-extras'
brew 'git-plus'
brew 'git-town'
brew 'github-keygen' # set up SSH via command line, add to setup script
brew 'gitless'
brew 'gitmoji'
brew 'gnu-sed' # Install GNU `sed`, overwriting the built-in `sed`.
brew "goles/battery/battery"
brew 'graphviz'
brew 'grep'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'imageoptim-cli'
brew 'jpeg'
brew 'jpegoptim'
brew 'jpegrescan'
brew 'libevent'
brew 'libidn2'
brew 'libunistring'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'moreutils'
brew 'ncurses'
brew 'open-completion'
brew 'openssl'
brew 'pandoc'
brew 'pip-completion'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'psgrep'
brew 'readline'
brew 'shellcheck'
brew 'speedtest-cli'
brew 'stow'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'ttf2eot'
brew 'vim'
brew 'webkit2png'
brew 'wget'
brew 'wifi-password'
brew 'woff2'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

# Development

# Apps
cask 'alfred'
cask 'appcleaner'
cask 'cheatsheet'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'itsycal'
cask 'jupyter-notebook-viewer'
cask 'kindle'
cask 'licecap'
cask 'spotify'
cask 'spectacle'
cask 'sublime-text'
cask 'suspicious-package'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# Quicklook'
cask 'betterzip'
cask 'ipynb-quicklook'
cask 'ttscoff-MMD-QuickLook' # MultiMarkdown
cask 'qladdict'
cask 'ql-ansilove'
cask 'qlcolorcode' # in color code
cask 'qlcommonmark'
cask 'qlgradle'
cask 'qlimagesize' # show image size
cask 'qlmarkdown'
cask 'qlmobi'
cask 'qlrest'
cask 'qlswift'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'QuickLookAPK' # Android packages https://github.com/hezi/QuickLookAPK
cask 'quicklookase'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'WebPQuickLook' # https://github.com/emin/WebPQuickLook

# Fonts
cask "font-hack"
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"

# Mac App Store
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Slack", id: 803453959
mas "Snip", id: 512505421
mas "The Unarchiver", id: 425424353